# WriteAccessLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..WriteAccessLevel Property
Schema Class See Also
---
Write access level of the schema.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AccessLevel WriteAccessLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WriteAccessLevel As AccessLevel
	Get
```

Visual C++
---
```text
public:
property AccessLevel WriteAccessLevel {
	AccessLevel get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace